# def обчислити_добуток_елементів(список):
#     добуток = 1
#     for елемент in список:
#         добуток *= елемент
#     return добуток
#
# список_чисел = [2, 3, 4, 5]
# результат = обчислити_добуток_елементів(список_чисел)
#
# print(f"Добуток елементів списку {список_чисел}: {результат}")
#
# def знайти_мінімум(список):
#     if not список:
#         # список порожній, повертаємо None
#         return None
#
#     мінімум = список[0]  # перший елемент списку.
#
#     for елемент in список:
#         if елемент < мінімум:
#             мінімум = елемент
#
#     return мінімум
#
# список_чисел = [5, 2, 8, 1, 7]
# результат = знайти_мінімум(список_чисел)
#
# print(f"Мінімум у списку {список_чисел}: {результат}")
#
# def чи_просте_число(n):
#     if n < 2:
#         return False
#     for i in range(2, int(n**0.5) + 1):
#         if n % i == 0:
#             return False
#     return True
#
# def кількість_простих_чисел(список):
#     кількість = 0
#     for число in список:
#         if чи_просте_число(число):
#             кількість += 1
#     return кількість
#
# список_чисел = [2, 3, 4, 5, 6, 7, 8, 9, 10, 11]
# результат = кількість_простих_чисел(список_чисел)
#
# print(f"Кількість простих чисел у списку {список_чисел}: {результат}")
#
# def видалити_елемент(список, число):
#     кількість_видалених = 0
#     while число in список:
#         список.remove(число)
#         кількість_видалених += 1
#     return кількість_видалених
#
# список_чисел = [1, 2, 3, 4, 2, 5, 2, 6]
# число_для_видалення = 2
# результат = видалити_елемент(список_чисел, число_для_видалення)
#
# print(f"Кількість видалених елементів {число_для_видалення} у списку {список_чисел}: {результат}")
# print("Змінений список:", список_чисел)
#
